### Q-1. Write an SQL query to print details of the Workers who have joined in Febâ€™2014.

SELECT * FROM workers WHERE YEAR(join_date) = 2014 AND MONTH(join_date) = 2;

### Q-2. Write an SQL query to fetch duplicate records having matching data in some fields of a table.

SELECT field1, field2, field3, COUNT(*) AS duplicate_count FROM your_table GROUP BY field1, field2, field3 HAVING COUNT(*) > 1;

### Q-3. How to remove duplicate rows from Employees table.

CREATE TABLE my_table (

  id INT AUTO_INCREMENT PRIMARY KEY,
  
  column1 VARCHAR(50),
  
  column2 VARCHAR(50),
  
  column3 VARCHAR(50)
);


INSERT INTO my_table (column1, column2, column3)

VALUES

  ('Value 1', 'Value 2', 'Value 3'),
  
  ('Value 1', 'Value 2', 'Value 3'),
  
  ('Value 4', 'Value 5', 'Value 6'),
  
  ('Value 7', 'Value 8', 'Value 9'),
  
  ('Value 7', 'Value 8', 'Value 9');

    
DELETE FROM my_table

WHERE id NOT IN (

  SELECT MIN(id)
  
  FROM my_table
  
  GROUP BY column1, column2, column3
);